---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.SystemClassification
source: html/be329290-0ca0-b6a6-85f8-d9e35be028f1.htm
---
# Autodesk.Revit.DB.MEPSystemType.SystemClassification Property

Identifies the classification for the system type

## Syntax (C#)
```csharp
public MEPSystemClassification SystemClassification { get; }
```

## Remarks
The system classification drives certain behavior such as sizing
 and connections to other systems